import django
print(django.get_version())

"""
设置在哪
什么设置？
pycharm设置
你的环境好乱
建议卸载所有的python环境
安装一个anconda
    conada 就一个 
    里面还有其他的环境呢
    那些2点击几的 都是mac自带的
    你里面有3.6和3.7的共存的
    perefer
    看见了没
    你现在需要把你的环境指为3.6的环境或者3。7的环境
    你在设置中找到你3.7的环境先
    ???人呢在
    道长老师 卸载我觉得不是一个好方法
    而且anconada 我只装过一次 装的是3。7的
    至于3。6的怎么来的 我也不知到
    你说吧
    mac怎么来的我也不知道没用过
    
    建议把环境整理整理然后创建虚拟环境使用
    创建虚拟环境 就在终端里创建白
    刚才的就是终端 道长老师 你创建吧
    我创建啊
    好吧
    终端在哪
    
    可以啦
    把环境指为我创建的哪个django_env的环
    
    
    
    就可以拉
    所以我现在在终端里面输入
    
    你刚打开的就是教程啊
    根据哪个来就行啊
    我原以为不用创建虚拟环境的
    
    可以不用创建虚拟环境
    但是你的环境太乱拉所以创建一个
    
    在世纪生产环境中都是虚拟环境
    防止污染其他环境？
    对
    前提是得在激活的虚拟环境下
    就好比这样
    
    明白否
    激活我知道怎么激活
    刚才输入了 创建好了 不知道在哪
    
    
    路径你可以自己切换的
    想放在哪就放在哪
    明白 现在是不是应该打开创建的
    
    
    对
    cd beijingtuling
    
    python manager runserver
    
    已经运行起来拉
    
    
    然后你重新创建一个，把项目创建到你需要创建的位置
    利用pycharm去打开编辑就行
    对 我刚才就是想用pycharm打开tulingxueyuan
    那这面就没啥问题拉
    我就先退远程吗
    这些大哥应该都讲过
    先等一下 
    我用pycharm打开下tulingxueyuan
    
    是这样的 gonghuidepro是这台mac的一个用户 
    还有一个管理员账户ghhd 
    cai
    
    
    
    
    
    
    
    不需要
    现在没什么问题拉
    只需要制定下你这个虚拟环境就行
    虚拟环境在当前登陆用户的家目录下的ancoanda里面找
    嗯嗯 但是不明白的是创建的虚拟环境 怎么就和pycharm连起来了？
    虚拟环境也是环境呢，只是在真实环境基础上又创建了一个
    和真实环境一样使用就行
    这个我当然能理解 但是是说 pycharm里面 preference里面 没看到djanggo
    -
    
    
    
    这个可能是系统不一样的原因
    你看看大哥的Django的第一课，他的系统绝对是也得自己召见去制定的
    win下貌似可以直接出来
    
    ==
    你这面应该没啥问题拉，建议认真听听课程内容
    这些都是讲过的
    我这面还有事，我得先扯拉
    好 谢谢道长老师了哈
    ok，客气拉
    认真听课
    拜拜
    嗯嗯
"""